In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -3.397855  0.934386
1    a  two -0.246963 -1.478395
2    b  one -1.192631 -0.686687
3    b  two  0.782585 -0.805079
4    a  one  0.640390 -1.149658

In [4]:
#group欄位是key1,資料在data1
#groupby(Series)
grouped=df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -1.001476
b   -0.205023
Name: data1, dtype: float64

In [10]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [11]:
means.unstack()

key2       one       two
key1
a    -1.378733 -0.246963
b    -1.192631  0.782585

In [13]:
#groupby(list)
states = np.array(['台北','台中','台中','台北','台北'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df

  key1 key2     data1     data2
0    a  one -3.397855  0.934386
1    a  two -0.246963 -1.478395
2    b  one -1.192631 -0.686687
3    b  two  0.782585 -0.805079
4    a  one  0.640390 -1.149658

In [14]:
df['data1'].groupby(states).mean()

台中   -0.719797
台北   -0.658294
Name: data1, dtype: float64

In [16]:
df['data1'].groupby(years).mean()

2005   -0.954078
2006   -0.276121
Name: data1, dtype: float64

In [19]:
#dataFrame的groupby()
#groupby('欄位名稱')
mydf = df.groupby('key1').mean()
mydf['data1']

key1
a   -1.001476
b   -0.205023
Name: data1, dtype: float64

In [26]:
mydf['data2']
df.groupby('key1').size()

key1
a    3
b    2
dtype: int64

In [22]:
df

  key1 key2     data1     data2
0    a  one -3.397855  0.934386
1    a  two -0.246963 -1.478395
2    b  one -1.192631 -0.686687
3    b  two  0.782585 -0.805079
4    a  one  0.640390 -1.149658

In [23]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.378733 -0.107636
     two  -0.246963 -1.478395
b    one  -1.192631 -0.686687
     two   0.782585 -0.805079

In [24]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64